Tekla Open API Reference for Tekla Structures 2025
DateTimeConstantFilterExpression Constructor (DateTime, IFormatProvider)
 Initializes a new instance of the DateTimeConstantFilterExpression class.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DateTimeConstantFilterExpression(
	DateTime Value,
	IFormatProvider Provider
)
Public Sub New (
	Value As DateTime,
	Provider As IFormatProvider
)
Parameters
Value
Type: System.DateTime
The value to represent.
Provider
Type: System.IFormatProvider
An IFormatProvider object.
See Also
Reference
DateTimeConstantFilterExpression Class
DateTimeConstantFilterExpression Overload
Tekla.Structures.Filtering Namespace